In [1]:
import sqlite3 
conn = sqlite3.connect('pets_database.db')
cur = conn.cursor()

In [5]:
[x[0] for x in cur.description]

['id', 'name', 'age', 'breed', 'owner_id']

In [2]:
cur.execute("""SELECT * from cats;""").fetchall()

[(1, 'Maru', 3, 'Scottish Fold', 1),
 (2, 'Hana', 1, 'Tabby', 1),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (4, 'Moe', 10, 'Tabby', None),
 (5, 'Patches', 2, 'Calico', None),
 (6, None, None, 'Tabby', None)]

In [7]:
cur.execute("""SELECT * FROM cats ORDER BY age;""").fetchall()  # ASC|DESC

[(6, None, None, 'Tabby', None),
 (2, 'Hana', 1, 'Tabby', 1),
 (5, 'Patches', 2, 'Calico', None),
 (1, 'Maru', 3, 'Scottish Fold', 1),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (4, 'Moe', 10, 'Tabby', None)]

In [8]:
cur.execute("""SELECT * FROM cats ORDER BY age DESC;""").fetchall()

[(4, 'Moe', 10, 'Tabby', None),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (1, 'Maru', 3, 'Scottish Fold', 1),
 (5, 'Patches', 2, 'Calico', None),
 (2, 'Hana', 1, 'Tabby', 1),
 (6, None, None, 'Tabby', None)]

In [13]:
cur.execute("""SELECT * FROM cats ORDER BY age DESC LIMIT 1;""").fetchall()

[(4, 'Moe', 10, 'Tabby', None)]

In [16]:
cur.execute("""SELECT * FROM cats ORDER BY age DESC;""").fetchall()

[(4, 'Moe', 10, 'Tabby', None),
 (3, "Lil' Bub", 5, 'American Shorthair', None),
 (1, 'Maru', 3, 'Scottish Fold', 1),
 (5, 'Patches', 2, 'Calico', None),
 (2, 'Hana', 1, 'Tabby', 1),
 (6, None, None, 'Tabby', None)]

In [17]:
cur.execute("""SELECT name FROM cats WHERE age BETWEEN 1 and 3;""").fetchall()

[('Maru',), ('Hana',), ('Patches',)]

In [18]:
cur.execute("""SELECT * FROM cats WHERE name IS null;""").fetchall()

[(6, None, None, 'Tabby', None)]

In [19]:
cur.execute("""SELECT COUNT(owner_id) FROM cats WHERE owner_id = 1;""").fetchall()

[(2,)]

### `GROUP BY`

Lastly, we'll talk about the handy aggregate function `GROUP BY`. Like its name
suggests, it groups your results by a given column.

Let's take our table of cats

```bash
id          name        age         breed          owner_id  
----------  ----------  ----------  -------------  ----------
1           Maru        3           Scottish Fold  1         
2           Hana        1           Tabby          1         
3           Lil\' Bub   5           American Shor            
4           Moe         10          Tabby                    
5           Patches     2           Calico                   
6                                   Tabby                    
```

Here, you can see at a glance that there are three tabby cats and
one of every other breed — but what if you had a larger database
where you couldn't just tally up the number of cats *grouped by*
breed? That's where — you guessed it! — `GROUP BY` comes in handy.

``` sql
SELECT breed, COUNT(breed) FROM cats GROUP BY breed;
```

In [23]:
cur.execute("""
                SELECT breed 
                FROM cats 
                GROUP BY breed
                ;""").fetchall()

[('American Shorthair',), ('Calico',), ('Scottish Fold',), ('Tabby',)]

In [26]:
cur.execute("""
                SELECT breed,owner_id,
                COUNT(breed) 
                FROM cats 
                GROUP BY breed, owner_id
            ;""").fetchall()

[('American Shorthair', None, 1),
 ('Calico', None, 1),
 ('Scottish Fold', 1, 1),
 ('Tabby', None, 2),
 ('Tabby', 1, 1)]

In [27]:
cur.execute("""SELECT cats.name FROM cats;""").fetchall()

[('Maru',), ('Hana',), ("Lil' Bub",), ('Moe',), ('Patches',), (None,)]

In [31]:
conn = sqlite3.connect('dogs.db')
cur = conn.cursor()

In [32]:
cur.execute("""SELECT name, breed FROM dogs;""").fetchall()

[('Snoopy', 'beagle'),
 ('McGruff', 'bloodhound'),
 ('Scooby', 'great dane'),
 ('Little Ann', 'coonhound'),
 ('Pickles', 'black lab'),
 ('Clifford', 'big red'),
 ('Lassie', 'collie'),
 ('Snowy', 'fox terrier'),
 (None, 'golden retriever')]

In [47]:
cur.execute("""
                SELECT name 
                FROM dogs
                ORDER BY name
            ;""").fetchall()  # ASC|DES

[(None,),
 ('Clifford',),
 ('Lassie',),
 ('Little Ann',),
 ('McGruff',),
 ('Pickles',),
 ('Scooby',),
 ('Snoopy',),
 ('Snowy',)]

In [52]:
cur.execute("""
                SELECT name, breed
                FROM dogs
                WHERE  hungry = 1
                ORDER BY age
                
            ;""").fetchall()

[('Snoopy', 'beagle'),
 ('Clifford', 'big red'),
 (None, 'golden retriever'),
 ('Scooby', 'great dane'),
 ('Lassie', 'collie'),
 ('Pickles', 'black lab')]

In [53]:
cur.execute("""
                SELECT name, age, temperament
                FROM dogs
                ORDER BY age DESC
                LIMIT 1
                
            ;""").fetchall()

[('Pickles', 13, 'mischievous')]

In [54]:
cur.execute("""
                SELECT *
                FROM dogs
                ORDER BY age
                LIMIT 3
                
            ;""").fetchall()

[(1, 'Snoopy', 3, 'M', 'beagle', 'friendly', 1),
 (6, 'Clifford', 4, 'M', 'big red', 'smiley', 1),
 (9, None, 4, 'M', 'golden retriever', 'playful', 1)]

In [55]:
cur.execute("""
                SELECT name, breed
                FROM dogs
                WHERE age BETWEEN 5 and 10 
                ORDER BY age DESC
                
            ;""").fetchall()

[('McGruff', 'bloodhound'),
 ('Snowy', 'fox terrier'),
 ('Lassie', 'collie'),
 ('Scooby', 'great dane'),
 ('Little Ann', 'coonhound')]

### Select the name, age, and hungry columns for hungry dogs between the ages of two and seven.  This query should also list these dogs in alphabetical order.

In [59]:
import pandas as pd

In [69]:
df = pd.DataFrame(cur.execute("""
                SELECT name, age, hungry
                FROM dogs
                WHERE age BETWEEN 2 and 7 
                ORDER BY name
                
            ;""").fetchall())
df.columns = [x[0] for x in cur.description]
df

         name  age  hungry
0        None    4       1
1    Clifford    4       1
2      Lassie    7       1
3  Little Ann    5       0
4      Scooby    6       1
5      Snoopy    3       1

In [ ]:
df.col